/* 
სორტირება ამორჩევით
მასივში ვეძებთ მინიმალურ ელემენტს და ვუცვლით ადგილებს მასივის პირველ ელემენტთან. 
შედემ ისევ მინიმალურს ვეძებთ და უცლით ადგილებს მასივის მეორე ელემენტთან
*/


const arr = [0,3,2,5,6,8,1,9,4,2,1,2,9,6,4,1,7,-1, -5, 23,6,2,35,6,3,32] // [0,1,1,2,3.......]


function selectionSort(array) {

//ციკლი 0-დან მასივის სიგრძემდე
    for (let i = 0; i < array.length; i++) {
        //ინდექსი
        let indexMin = i
        for (let j = i+1; j < array.length; j++) {
            //თუ მასივის J ელემენტი ნაკლებია მასივის პირველ ელემენტზე
            if (array[j] < array[indexMin]) {
                indexMin = j
            }
            
        }
        //შევინახოთ პირველი ელემენტი
        let tmp = array[i]
        //პირველის ადგილზე ჩავსვათ მასზე ნაკლები
        array[i] = array[indexMin]
        //პირველზე ნაკლების ადგილას ჩავსვათ პირველი
        array[indexMin] = tmp
    }
    return array
}

console.log(selectionSort(arr))
